--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local function __TS__ArrayFind(array, hexId)
    local result = nil

    if type(array) == "table" then
        for ____, item in ipairs(array) do
            if item == hexId then
                result = item
                break
            end
        end
    end

    return result
end

local function __TS__ArrayPush(array, ...)
    local args = {...}

    for ____, arg in ipairs(args) do
        local matchedItem = __TS__ArrayFind(array, arg)
        if matchedItem == nil then
            array[#array + 1] = arg
        end
    end
end

--[药品]
local arr_medicines = {
    --回复药
    "04100006",
    --回复药G
    "04100007",
    --秘药
    "04100005",
    --远古秘药
    "041001D3",
    --解毒药
    "0410000D",
    --汉方药
    "041001DB",
    --打消果实
    "04100081",
    --消散剂
    "0410000E",
    --除臭球
    "0410000F",
    --元气饮料
    "04100089",
    --携带食料
    "041001D8",
    --半生肉
    "041001D1",
    --烤熟的肉
    "04100008",
    --烤焦的肉
    "041001D2",
    --活力剂
    "041001D7",
    --强走药
    "041001D9",
    --怪力种子
    "041001DF",
    --鬼人药
    "041001DD",
    --鬼人药G
    "041001DE",
    --忍耐种子
    "041001E4",
    --硬化药
    "041001E2",
    --硬化药G
    "041001E3",
    --生命粉尘
    "04100009",
    --生命大粉尘
    "041001D4",
    --汉方粉尘
    "041001DC",
    --鬼人粉尘
    "041001E0",
    --硬化粉尘
    "041001E5"
}

--[辅助道具]
local arr_auxItems = {
    --闪光球
    "041000A3",
    --音爆球
    "041001ED",
    --异臭球
    "04100413",
    --捕获用麻醉球
    "041001EE",
    --毒烟雾球
    "041001EC",
    --回归球
    "041001EB",
    --生肉
    "0410007A",
    --毒生肉
    "041001E8",
    --麻痹生肉
    "041001E9",
    --睡眠生肉
    "041001EA",
    --小桶爆弹
    "04100002",
    --大桶爆弹
    "04100003",
    --大桶爆弹G
    "041001E7",
    --落穴陷阱
    "0410007B",
    --麻痹陷阱
    "04100004"
}

--[素材]
local arr_materials = {
    --炸药
    "041002D7",
    --小木桶
    "04100018",
    --大木桶
    "04100019",
    --常春藤叶
    "041002BF",
    --蜘蛛网
    "041002D6",
    --网子
    "041003D9",
    --陷阱工具
    "0410001A",
    --增强剂
    "041003D8",
    --蜂蜜
    "0410007D",
    --药草
    "04100080",
    --解毒草
    "041001DA",
    --火药草
    "041002BE",
    --流水草
    "041002C2",
    --霜降草
    "041002C1",
    --眠草
    "041002C0",
    --落阳草
    "041002C3",
    --落阳草的花
    "041002C4",
    --木天蓼
    "041002C5",
    --蓝蘑菇
    "0410007E",
    --曼陀罗
    "041002B2",
    --硝化伞菇
    "041002AE",
    --毒菇
    "041002B0",
    --麻痹菇
    "041002AF",
    --心跳加速菇
    "041002B1",
    --苦虫
    "041002BB",
    --不死虫
    "0410007F",
    --雷光虫
    "041002BD",
    --光虫
    "041002BC",
    --怪物的粪
    "04100412",
    --烟果实
    "041002C6",
    --贯穿果实
    "04100082",
    --针果实
    "041002C9",
    --空心果实
    "041002C8",
    --爆裂果实
    "041002CB",
    --扩散果实
    "041002CA",
    --屠龙果实
    "041002C7",
    --斩裂果实
    "041002CD",
    --龙击果实
    "041002CC",
    --LV2火药粉
    "041003DA",
    --着火果实
    "041003E2",
    --LV3火药粉
    "041003DB",
    --发火果实
    "041003E1"
}

--[弹药]
local arr_ammos = {
    --LV2通常弹
    "0410001E",
    --LV3通常弹
    "0410001F",
    --LV1贯通弹
    "04100020",
    --LV2贯通弹
    "04100021",
    --LV3贯通弹
    "04100022",
    --LV1散弹
    "04100023",
    --LV2散弹
    "04100024",
    --LV3散弹
    "04100025",
    --LV1放散弹
    "0410008A",
    --LV2放散弹
    "0410008B",
    --LV3放散弹
    "0410008C",
    --LV1穿甲榴弹
    "04100026",
    --LV2穿甲榴弹
    "04100027",
    --LV3穿甲榴弹
    "04100098",
    --LV1扩散弹
    "04100028",
    --LV2扩散弹
    "04100029",
    --LV3扩散弹
    "04100099",
    --火炎弹
    "04100033",
    --贯穿火炎弹
    "0410009D",
    --水冷弹
    "04100034",
    --贯穿水冷弹
    "0410009E",
    --电击弹
    "04100035",
    --贯穿电击弹
    "041000A0",
    --冰结弹
    "04100036",
    --贯穿冰结弹
    "0410009F",
    --灭龙弹
    "041000A1",
    --贯穿灭龙弹
    "041000A2",
    --斩裂弹
    "04100037",
    --龙击弹
    "04100038",
    --LV1毒弹
    "0410002A",
    --LV2毒弹
    "0410002B",
    --LV1麻痹弹
    "0410002C",
    --LV2麻痹弹
    "0410002D",
    --LV1睡眠弹
    "0410002E",
    --LV2睡眠弹
    "0410002F",
    --LV1减气弹
    "04100030",
    --LV2减气弹
    "04100031",
    --LV1回复弹
    "04100032",
    --LV2回复弹
    "0410009A",
    --鬼人弹
    "0410009B",
    --硬化弹
    "0410009C",
    --捕获用麻醉弹
    "04100039"
}

--[瓶]
local arr_bottles = {
    --强击瓶
    "0410003A",
    --毒瓶
    "0410003C",
    --麻痹瓶
    "0410003D",
    --睡眠瓶
    "0410003E",
    --爆破瓶
    "0410003F",
    --减气瓶
    "04100041"
}

local arr_fishs = {
    --刺身鱼
    "041001D6",
    --烤熟的鱼
    "041001D5",
    --磨刀鲹鱼
    "041001F3",
    --大磨刀鲹鱼
    "0410030E",
    --扩散金鱼
    "04100313",
    --炸裂沙丁鱼
    "04100367",
    --着火鲣鱼
    "0410030F",
    --大着火鲣鱼
    "04100310",
    --发火旗鱼
    "04100311",
    --大发火旗鱼
    "04100312"
}

local arr_specialItems = {
    --铠玉
    "04100095",
    --上铠玉
    "04100096",
    --尖铠玉
    "04100097",
    --坚铠玉
    "04100409",
    --重铠玉
    "0410040A",
    --王铠玉
    "04100AF8",
    --水光原珠
    "0410040B",
    --修罗原珠
    "0410040C",
    --琉璃原珠
    "0410040D",
    --金刚原珠
    "04100AF5",
    --明王原珠
    "04100AF6",
    --怪异原珠
    "04100AF7",
    --特制团子卷
    "0410007C",
    --商人橡子
    "04100411",
    --领悟橡子
    "041007D1",
    --药用神秘油
    "041007D5",
    --浓稠神秘油
    "041007D4",
    --特浓神秘油
    "041007D3",
    --迅炼丹
    "041007D2"
}

local arr_result = {}
__TS__ArrayPush(arr_result, table.unpack(arr_medicines))
__TS__ArrayPush(arr_result, table.unpack(arr_auxItems))
__TS__ArrayPush(arr_result, table.unpack(arr_materials))
__TS__ArrayPush(arr_result, table.unpack(arr_ammos))
__TS__ArrayPush(arr_result, table.unpack(arr_bottles))
__TS__ArrayPush(arr_result, table.unpack(arr_fishs))
__TS__ArrayPush(arr_result, table.unpack(arr_specialItems))
return arr_result
